_name = input('Введите свое имя')  # СОВЕТ: Такое имя переменной валидно, но не совсем понятно, зачем здесь знак подчёркивания
surname = input('Введите свою фамилию')
year = int(input('Введите год рождения'))

print(surname, _name, ",", (2024 - year))

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     20

# Пример вывода:
#     Следующее за числом 20 число: 21
#     Для числа 20 предыдущее число: 19